
sin aprēķināšana:
Ievadi argumentu x: 0.24
sin(0.24)=0.06
a0 = 0.06 S0 = 0.06
a36 = 0.00 S36 = 0.06
a100 = 0.00 S100 = 0.06
sin (0.24) caur summu: 0.06
           100 
        -------- 
        \                 k     4*k+2 
         \            (-1)   * x 
sin(0.24)= >       ---------------------- 
         /                 (2*k+1)! 
        / 
        -------- 
          k = 0 
                                   4 
                           (-1) * x 
Rekurences reizinātājs:  ----------------- 
                           (4*k)*(4*k+1) 
>>> 
